app/views/documentation/_api_v1_applications.html.slim

SELECT "oauth_access_tokens".* FROM "oauth_access_tokens" WHERE "oauth_access_tokens"."application_id" = $1 AND "oauth_access_tokens"."resource_owner_id" = $2 AND (revoked_at IS NULL)  [["application_id", 1], ["resource_owner_id", 2]]
---
                    = application.secret
            - tokens = application.access_tokens.where(resource_owner_id: current_user.id).where('revoked_at IS NULL').select{ |t| t.expired? != true }