app/controllers/documentation_controller.rb

  def authorize
    @access_code = params[:code]
    @access_grant = Doorkeeper::AccessGrant.where(resource_owner_id: current_user.id, token: @access_code).last
---
SELECT  "oauth_access_grants".* FROM "oauth_access_grants" WHERE "oauth_access_grants"."resource_owner_id" = $1 AND "oauth_access_grants"."token" = $2  ORDER BY "oauth_access_grants"."id" DESC LIMIT 1  [["resource_owner_id", 2], ["token", "ce578f6a9c83bcbc78e53ac45b10c8110e22e5584b04d6fca53feedb85a0ed72"]]